In [8]:
import numpy as np
import pandas as pd

In [11]:
dicta = {
    "name" : ["harry", "rohan"],
    "marks" : [ 40, 95 ],
    "city" : ["bang", "myso"]
}

In [12]:
df = pd.DataFrame(dicta)

In [13]:
df

    name  marks  city
0  harry     40  bang
1  rohan     95  myso

In [15]:
df.to_csv("test.csv", index=False)

In [16]:
df.describe()

           marks
count   2.000000
mean   67.500000
std    38.890873
min    40.000000
25%    53.750000
50%    67.500000
75%    81.250000
max    95.000000

In [19]:
impo = pd.read_csv("data_marks.csv")

In [20]:
impo

   Unnamed: 0  name  marks
0           0  mr x     99
1           1  mr y     95